Revit 2024 API
PipeFittingAndAccessoryPressureDropData.SetDefaultEntity Method
 Stores the default entity in the data.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetDefaultEntity(
	Entity defaultEntity
)
Visual Basic
Public Sub SetDefaultEntity ( _
	defaultEntity As Entity _
)
Visual C++
public:
void SetDefaultEntity(
	Entity^ defaultEntity
)
Parameters
defaultEntity
Type: Autodesk.Revit.DB.ExtensibleStorage.Entity
 The Entity to be stored.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Writing of Entities of this Schema is not allowed to the current add-in.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace